<template>
    <section class="hero">
        <div class="container">
            <div class="row">
                <div class="col-12">
                    <div class="hero__wrapper">
                        <div class="hero__description">
                            <h1 class="hero__title">Используй максимум возможностей</h1>
                            <p class="hero__text">Lorem ipsum dolor sit amet consectetur, adipisicing elit. Dolores at magnam natus repellat accusamus iusto ea laboriosam sequi? Reprehenderit fugit cumque modi, explicabo debitis aliquam! Numquam voluptatem repellat ipsam. Modi.</p>
                            <router-link to="/vehicles" class="hero__button button">Приступить</router-link>
                        </div>
                        <div class="hero__preview">
                            <img src="@/assets/images/car.png" alt="car" class="hero__image">
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
    <section class="section how-it-work">
        <div class="container">
            <div class="row">
                <div class="col-12">
                    <h2 class="section__title">Как Это Работает</h2>
                </div>
                <div class="col-12">
                    <ul class="how-it-work__list">
                        <li class="how-it-work__item">
                            <svg xmlns="http://www.w3.org/2000/svg" version="1.1" width="40px" height="40px" viewBox="0 0 24 24">
                                <path fill="currentColor" d="M11.5,11L17.88,16.37L17,16.55L16.36,16.67C15.73,16.8 15.37,17.5 15.65,18.07L15.92,18.65L17.28,21.59L15.86,22.25L14.5,19.32L14.24,18.74C13.97,18.15 13.22,17.97 12.72,18.38L12.21,18.78L11.5,19.35V11M10.76,8.69A0.76,0.76 0 0,0 10,9.45V20.9C10,21.32 10.34,21.66 10.76,21.66C10.95,21.66 11.11,21.6 11.24,21.5L13.15,19.95L14.81,23.57C14.94,23.84 15.21,24 15.5,24C15.61,24 15.72,24 15.83,23.92L18.59,22.64C18.97,22.46 19.15,22 18.95,21.63L17.28,18L19.69,17.55C19.85,17.5 20,17.43 20.12,17.29C20.39,16.97 20.35,16.5 20,16.21L11.26,8.86L11.25,8.87C11.12,8.76 10.95,8.69 10.76,8.69M15,10V8H20V10H15M13.83,4.76L16.66,1.93L18.07,3.34L15.24,6.17L13.83,4.76M10,0H12V5H10V0M3.93,14.66L6.76,11.83L8.17,13.24L5.34,16.07L3.93,14.66M3.93,3.34L5.34,1.93L8.17,4.76L6.76,6.17L3.93,3.34M7,10H2V8H7V10" />
                            </svg>
                        </li>
                        <li class="how-it-work__item">
                            <svg version="1.1" xmlns="http://www.w3.org/2000/svg" height="40px" width="40px" viewBox="0 0 63 63">
                                <path fill="currentColor" d="M58.004,44.772c-0.828,0-1.607-0.673-1.607-1.501c0-0.83,0.832-1.501,1.661-1.501
                                        c0.44,0,1.942,0,1.942-2.568v-4.098c0-3.587-3.343-6.505-6.927-6.505h-44C5.489,28.599,3,31.517,3,35.104v3.751
                                        c0,1.518,0.808,2.753,2.324,2.753h2.249c0.828,0,1.5,0.672,1.5,1.501c0,0.829-0.672,1.501-1.5,1.501H5.324
                                        C2.153,44.61,0,42.029,0,38.855v-3.751c0-5.242,3.835-9.507,9.073-9.507h44c5.239,0,9.927,4.265,9.927,9.507v4.098
                                        C63,42.586,60.91,44.772,58.004,44.772z"/>
                                <path fill="currentColor" d="M44.573,44.61h-24c-0.828,0-1.5-0.672-1.5-1.501c0-0.829,0.672-1.501,1.5-1.501h24
                                            c0.828,0,1.5,0.672,1.5,1.501C46.073,43.938,45.401,44.61,44.573,44.61z"/>
                                <path fill="currentColor" d="M44.533,27.598c-0.819,0-1.488-0.906-1.5-1.728c-0.073-5.271-6.653-11.29-15.349-11.29
                                            c-8.464,0-15.35,4.938-15.35,11.083c0,0.829-0.672,1.47-1.5,1.47s-1.5-0.687-1.5-1.516c0-7.801,8.231-14.155,18.35-14.155
                                            c9.669,0,18.245,6.845,18.349,14.371c0.012,0.828-0.65,0.765-1.479,1.765C44.547,27.598,44.54,27.598,44.533,27.598z"/>
                                <path fill="currentColor" d="M51.514,51.538c-4.06,0-7.363-3.305-7.363-7.367s3.303-7.367,7.363-7.367
                                            c4.059,0,7.362,3.305,7.362,7.367S55.573,51.538,51.514,51.538z M51.514,39.806c-2.406,0-4.363,1.958-4.363,4.365
                                            s1.957,4.365,4.363,4.365c2.405,0,4.362-1.958,4.362-4.365S53.919,39.806,51.514,39.806z"/>
                                <path fill="currentColor" d="M14.376,50.538c-4.06,0-7.362-3.306-7.362-7.367c0-4.063,3.302-7.368,7.362-7.368
                                            c4.059,0,7.362,3.305,7.362,7.368C21.738,47.232,18.435,50.538,14.376,50.538z M14.376,38.805c-2.405,0-4.362,1.959-4.362,4.366
                                            s1.957,4.364,4.362,4.364s4.362-1.957,4.362-4.364S16.781,38.805,14.376,38.805z"/>
                                <path fill="currentColor" d="M27.5,28.099c-0.828,0-1.5-0.673-1.5-1.501V13.589c0-0.83,0.672-1.502,1.5-1.502s1.5,0.672,1.5,1.502
                                            v13.009C29,27.426,28.328,28.099,27.5,28.099z"/>
                                <path fill="currentColor" d="M60.573,34.603h-4c-0.828,0-1.5-0.672-1.5-1.501c0-0.829,0.672-1.501,1.5-1.501h4
                                            c0.828,0,1.5,0.672,1.5,1.501C62.073,33.931,61.401,34.603,60.573,34.603z"/>
                            </svg>
                        </li>
                        <li class="how-it-work__item">
                            <svg width="40px" height="40px" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg">
                                <path fill="currentColor" d="M8 1a3 3 0 1 0 0 6 3 3 0 0 0 0-6zM4 4a4 4 0 1 1 4.5 3.969V13.5a.5.5 0 0 1-1 0V7.97A4 4 0 0 1 4 3.999zm2.493 8.574a.5.5 0 0 1-.411.575c-.712.118-1.28.295-1.655.493a1.319 1.319 0 0 0-.37.265.301.301 0 0 0-.057.09V14l.002.008a.147.147 0 0 0 .016.033.617.617 0 0 0 .145.15c.165.13.435.27.813.395.751.25 1.82.414 3.024.414s2.273-.163 3.024-.414c.378-.126.648-.265.813-.395a.619.619 0 0 0 .146-.15.148.148 0 0 0 .015-.033L12 14v-.004a.301.301 0 0 0-.057-.09 1.318 1.318 0 0 0-.37-.264c-.376-.198-.943-.375-1.655-.493a.5.5 0 1 1 .164-.986c.77.127 1.452.328 1.957.594C12.5 13 13 13.4 13 14c0 .426-.26.752-.544.977-.29.228-.68.413-1.116.558-.878.293-2.059.465-3.34.465-1.281 0-2.462-.172-3.34-.465-.436-.145-.826-.33-1.116-.558C3.26 14.752 3 14.426 3 14c0-.599.5-1 .961-1.243.505-.266 1.187-.467 1.957-.594a.5.5 0 0 1 .575.411z"/>
                            </svg>
                        </li>
                        <li class="how-it-work__item">
                            <svg version="1.1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 30.031 30.031" height="40px" width="40px">
                                <path fill="currentColor" d="m25.299,8.779c0.977-0.977 0.977-2.559 0-3.535-0.976-0.977-2.559-0.977-3.535,0-0.977,0.977-0.977,2.559 0,3.535 0.976,0.977 2.559,0.977 3.535,0zm-5.768,6.701h3.502c0.383,0.218 0.872,0.182 1.199-0.142l3.539-3.505c0.042-0.042 0.061-0.095 0.094-0.141 0.084-0.075 0.179-0.13 0.26-0.21 2.541-2.517 2.541-6.598 0-9.114-2.541-2.517-6.661-2.517-9.202,0s-2.541,6.598 0,9.114c0.081,0.08 0.176,0.135 0.26,0.21 0.033,0.046 0.052,0.099 0.094,0.141l1.695,1.679h-1.504v0.037c-2.456,0.035-4.438,2.03-4.438,4.494 0,2.485 2.015,4.438 4.5,4.438h4c1.381,0 2.5,1.15 2.5,2.531s-1.119,2.5-2.5,2.5h-14.537l1.761-1.744c0.042-0.042 0.061-0.094 0.094-0.141 0.084-0.075 0.179-0.13 0.26-0.21 2.541-2.517 2.541-6.598 0-9.114-2.541-2.517-6.661-2.517-9.202,0-2.541,2.517-2.541,6.598 0,9.114 0.081,0.08 0.176,0.135 0.26,0.21 0.033,0.047 0.052,0.099 0.094,0.141l3.539,3.505c0.265,0.263 0.638,0.332 0.975,0.239h16.82v-0.006c2.456-0.035 4.438-2.03 4.438-4.494 0-2.448-1.957-4.43-4.391-4.489v-0.011l-4.234,.019c-1.321-0.067-2.375-1.15-2.375-2.487-0.001-1.382 1.118-2.564 2.499-2.564zm.818-5.39l.001-.001c-0.003-0.004-0.007-0.006-0.011-0.009-1.759-1.742-1.759-4.567 0-6.31 1.759-1.742 4.611-1.742 6.371,0 1.759,1.742 1.759,4.567 0,6.31-0.011,0.011-0.024,0.017-0.036,0.028l.003,.004-3.153,3.122-3.175-3.144zm-13.842,17.08l-3.175-3.146v-0.001c-0.003-0.003-0.007-0.006-0.011-0.009-1.759-1.742-1.759-4.567 0-6.31 1.759-1.742 4.611-1.742 6.371,0 1.759,1.742 1.759,4.567 0,6.31-0.011,0.011-0.024,0.018-0.036,0.029l.003,.003-3.152,3.124zm-1.743-7.926c-0.977,0.977-0.977,2.559 0,3.535 0.976,0.977 2.559,0.977 3.535,0 0.977-0.977 0.977-2.559 0-3.535-0.976-0.976-2.559-0.976-3.535,0z"/>
                            </svg>
                        </li>
                    </ul>
                </div>
                <div class="how-it-work__description col-3">
                    <p class="how-it-work__title">В несколько кликов</p>
                    <p class="how-it-work__content">Откройте сайт и всего за несколько кликов откройте необходимую вам услугу.</p>
                </div>
                <div class="how-it-work__description col-3">
                    <p class="how-it-work__title">Выберите транспорт</p>
                    <p class="how-it-work__content">Ознакомтесь с огромным списком доступных автомобилей и велосипедов. Выберите именно тот, который вам понравился.</p>
                </div>
                <div class="how-it-work__description col-3">
                    <p class="how-it-work__title">Поиск транспортного средства</p>
                    <p class="how-it-work__content">Система подберет ближайшее к вам транспортное средство. Вы можете изменить условия поиска.</p>
                </div>
                <div class="how-it-work__description col-3">
                    <p class="how-it-work__title">Навигация на всех этапах</p>
                    <p class="how-it-work__content">Во время поездки умная система поможет избежать пробок и найдет самые удобные маршруты.</p>
                </div>
            </div>
        </div>
    </section>
    <section class="section section--line">
        <img src="@/assets/images/bike.jpg" alt="bike" class="section__preview">
    </section>
    <section class="section blog">
        <div class="container">
            <div class="row">
                <div class="col-12">
                    <h2 class="section__title">Новости</h2>
                </div>
            </div>
            <div class="row">
                <ArticleItem
                    v-for="article in articles"
                    :key="article.id"
                    :article="article"
                />
            </div>
        </div>
    </section>
</template>

<script>

import ArticleItem from "@/components/ArticleItem";
import {mapActions, mapState} from "vuex";

export default {
    name: 'HomeView',
    components: { ArticleItem },
    computed: {
        ...mapState({
            articles: state => state.articles.articles
        })
    },
    methods: {
        ...mapActions({
            loadingArticles: 'articles/loadingArticles'
        })
    },
    created() {
        this.loadingArticles();
    },
    mounted() {
        document.title = 'Car&bike - аренда автомобилей и велосипедов';
    }
}
</script>
